In [1]:
import pandas as pd

In [2]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
list('321')

['3', '2', '1']

In [4]:
df = pd.DataFrame(data, index = list('321'), columns = list('ZXY'))
df

   Z  X  Y
3  1  2  3
2  4  5  6
1  7  8  9

In [5]:
df.sort_index(inplace=True)
df

   Z  X  Y
1  7  8  9
2  4  5  6
3  1  2  3

In [7]:
df.sort_index(inplace=True, axis=1)
df

   X  Y  Z
1  8  9  7
2  5  6  4
3  2  3  1

In [10]:
df.sort_values(by = ['X', 'Y'], inplace=True)
df

   Z  X  Y
3  1  2  3
2  4  5  6
1  7  8  9

In [11]:
df.sort_values(by = '3', axis = 1, inplace=True)
df

   Z  X  Y
3  1  2  3
2  4  5  6
1  7  8  9